## Plan Result (prod_app_registrations)




<pre><code>Plan: 5 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.this.azuread_application.this[&#34;darts-portal&#34;]
  * module.this.azuread_application_federated_identity_credential.this[&#34;darts-portal-repo:hmcts/darts-portal:pull_request&#34;]
  * module.this.azuread_application_federated_identity_credential.this[&#34;darts-portal-repo:hmcts/darts-portal:ref:refs/heads/master&#34;]
  * module.this.azuread_service_principal.this[&#34;darts-portal&#34;]
  * module.this.azurerm_role_assignment.this[&#34;darts-portal-Reader-/providers/Microsoft.Management/managementGroups/CFT-NonProd&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.this.azuread_application.this["darts-portal"] will be created
  + resource "azuread_application" "this" {
      + app_role_ids                = (known after apply)
      + application_id              = (known after apply)
      + disabled_by_microsoft       = (known after apply)
      + display_name                = "darts-portal"
      + id                          = (known after apply)
      + logo_url                    = (known after apply)
      + oauth2_permission_scope_ids = (known after apply)
      + object_id                   = (known after apply)
      + owners                      = [
          + "dad693c4-36ad-468f-94e9-76faa4bc844b",
        ]
      + prevent_duplicate_names     = false
      + publisher_domain            = (known after apply)
      + sign_in_audience            = "AzureADMyOrg"
      + tags                        = (known after apply)
      + template_id                 = (known after apply)

      + feature_tags {
          + custom_single_sign_on = (known after apply)
          + enterprise            = (known after apply)
          + gallery               = (known after apply)
          + hide                  = (known after apply)
        }
    }

  # module.this.azuread_application_federated_identity_credential.this["darts-portal-repo:hmcts/darts-portal:pull_request"] will be created
  + resource "azuread_application_federated_identity_credential" "this" {
      + application_object_id = (known after apply)
      + audiences             = [
          + "api://AzureADTokenExchange",
        ]
      + credential_id         = (known after apply)
      + display_name          = "repo_hmcts__darts-portal_pull_request"
      + id                    = (known after apply)
      + issuer                = "https://token.actions.githubusercontent.com"
      + subject               = "repo:hmcts/darts-portal:pull_request"
    }

  # module.this.azuread_application_federated_identity_credential.this["darts-portal-repo:hmcts/darts-portal:ref:refs/heads/master"] will be created
  + resource "azuread_application_federated_identity_credential" "this" {
      + application_object_id = (known after apply)
      + audiences             = [
          + "api://AzureADTokenExchange",
        ]
      + credential_id         = (known after apply)
      + display_name          = "repo_hmcts__darts-portal_ref_refs__heads__master"
      + id                    = (known after apply)
      + issuer                = "https://token.actions.githubusercontent.com"
      + subject               = "repo:hmcts/darts-portal:ref:refs/heads/master"
    }

  # module.this.azuread_service_principal.this["darts-portal"] will be created
  + resource "azuread_service_principal" "this" {
      + account_enabled             = true
      + app_role_ids                = (known after apply)
      + app_roles                   = (known after apply)
      + application_id              = (known after apply)
      + application_tenant_id       = (known after apply)
      + display_name                = (known after apply)
      + homepage_url                = (known after apply)
      + id                          = (known after apply)
      + logout_url                  = (known after apply)
      + oauth2_permission_scope_ids = (known after apply)
      + oauth2_permission_scopes    = (known after apply)
      + object_id                   = (known after apply)
      + owners                      = [
          + "dad693c4-36ad-468f-94e9-76faa4bc844b",
        ]
      + redirect_uris               = (known after apply)
      + saml_metadata_url           = (known after apply)
      + service_principal_names     = (known after apply)
      + sign_in_audience            = (known after apply)
      + tags                        = (known after apply)
      + type                        = (known after apply)

      + feature_tags {
          + custom_single_sign_on = (known after apply)
          + enterprise            = (known after apply)
          + gallery               = (known after apply)
          + hide                  = (known after apply)
        }

      + features {
          + custom_single_sign_on_app = (known after apply)
          + enterprise_application    = (known after apply)
          + gallery_application       = (known after apply)
          + visible_to_users          = (known after apply)
        }
    }

  # module.this.azurerm_role_assignment.this["darts-portal-Reader-/providers/Microsoft.Management/managementGroups/CFT-NonProd"] will be created
  + resource "azurerm_role_assignment" "this" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Reader"
      + scope                            = "/providers/Microsoft.Management/managementGroups/CFT-NonProd"
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 5 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  ~ app_registrations = {
      + darts-portal                      = {
          + application_id    = (known after apply)
          + display_name      = "darts-portal"
          + id                = (known after apply)
          + object_id         = (known after apply)
          + owners            = [
              + "dad693c4-36ad-468f-94e9-76faa4bc844b",
            ]
          + publisher_domain  = (known after apply)
          + service_principal = {
              + application_id        = (known after apply)
              + application_tenant_id = (known after apply)
              + id                    = (known after apply)
              + object_id             = (known after apply)
            }
        }
        # (8 unchanged elements hidden)
    }
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":60,"Program":"tfcmt","SHA1":"","Target":"prod_app_registrations","Vars":{}} -->